app/controllers/reflections_controller.rb

  def create
    @reflection = Reflection.find(params[:reflection_id])
---
SELECT  "reflections".* FROM "reflections" WHERE "reflections"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

  def index
    @reflections = Reflection.all
---
SELECT "reflections".* FROM "reflections"

  def show
    @reflection = Reflection.find(params[:id])
---
SELECT  "reflections".* FROM "reflections" WHERE "reflections"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def destroy
    @reflection = Reflection.find(params[:id])
    @reflection.destroy
---
SELECT  "reflections".* FROM "reflections" WHERE "reflections"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "reflections" WHERE "reflections"."id" = $1  [["id", 2]]